Repository: elly-code/cherrypick
Catalog: po/extra/*.po
Languages: de, es, fr, it, ru

source: Color Picker
de: Farbwähler
es: Selector de color
fr: Sélecteur de couleurs
it: Selettore Colore
ru: Подборщик цветов

source: Pick colors on your screen
de: Farben auf Ihrem Bildschirm auswählen
fr: Sélectionnez des couleurs sur votre écran
it: Seleziona colori sullo schermo

source: Color;Pick;Eyedropper;Picker;
de: Farbe;Pick;Pipette;Picker;
es: Color;Pick;Cuentagotas;Picker;
fr: Couleur;Pick;Eyedropper;Picker ;
it: Colore;Seleziona;Contagocce;Selettore;

source: Pick a color
de: Eine farbe wählen
fr: Choisissez une couleur
it: Seleziona un colore

source: A modern and trusty color picker
de: Ein moderner und zuverlässiger Farbwähler
es: Un selector de color moderno y fiable
fr: Un sélecteur de couleurs moderne et fiable
it: Un selettore colore moderno e affidabile

source: Features:
de: Merkmale:
es: Características:
fr: Caractéristiques :
it: Caratteristiche:
ru: Функции:

source: Choose different output formats (RGB, RGBA, HEX, CMYK, HSL, HSLA)
de: Wählen Sie verschiedene Ausgabeformate (RGB, RGBA, HEX, CMYK, HSL, HSLA)
es: Elija diferentes formatos de salida (RGB, RGBA, HEX, CMYK, HSL, HSLA)
fr: Choisissez différents formats de sortie (RGB, RGBA, HEX, CMYK, HSL, HSLA)
it: Scegli diversi formati di output (RGB, RGBA, HEX, CMYK, HSL, HSLA)
ru: Выбор различные форматы цветов (RGB, RGBA, HEX, CMYK, HSL, HSLA)

source: Remembers your preferred format
de: Erinnert sich an Ihr bevorzugtes Format
es: Recuerda tu formato preferido
fr: Se souvient de votre format préféré
it: Ricorda il tuo formato preferito
ru: Запоминание вашего предпочитаемого формата

source: Color history remembers your last picked colors (hover to check their code)
de: Der Farbverlauf speichert Ihre zuletzt gewählten Farben (bewegen Sie den Mauszeiger, um ihren Code zu überprüfen)
es: El historial de colores recuerda los últimos colores elegidos (pasa el ratón por encima para comprobar su código)
fr: L'historique des couleurs se souvient des dernières couleurs choisies (survoler pour vérifier leur code)
it: La cronologia colori ricorda gli ultimi colori selezionati (passa sopra con il mouse per vedere il loro codice)

source: Curious about a color? Copy paste it from your clipboard to preview it
de: Neugierig auf eine Farbe? Kopieren und Einfügen aus der Zwischenablage für eine Vorschau
es: ¿Tienes curiosidad por un color? Cópielo y péguelo desde el portapapeles para obtener una vista previa.
fr: Curieux d'une couleur ? Copiez-collez-la depuis votre presse-papiers pour en avoir un aperçu.
it: Sei curioso di un colore? Copia e incollalo dalla clipboard per visualizzarlo in anteprima
ru: Любопытно узнать о цвете? Скопируйте его из буфера обмена для предварительного просмотра

source: You can set a keybind to immediately pick and copy to clipboard!
de: Sie können eine Tastenkombination festlegen, um sofort zu wählen und in die Zwischenablage zu kopieren!
es: Puedes establecer una combinación de teclas para seleccionar y copiar inmediatamente en el portapapeles.
fr: Vous pouvez définir un raccourci clavier pour sélectionner et copier immédiatement dans le presse-papiers !
it: Puoi impostare un tasto di scelta rapida per selezionare e copiare immediatamente negli appunti!
ru: Вы можете установить привязку клавиш, чтобы немедленно выбрать и скопировать в буфер обмена!

source: Cherrypick's main window
de: Das Hauptfenster von Cherrypick
es: Ventana principal de Cherrypick
fr: Fenêtre principale de Cherrypick
it: La finestra principale di Cherrypick
ru: Главное окно Cherrypick

source: Main window with dark theme
de: Hauptfenster mit dunklem Thema
es: Ventana principal con tema oscuro
fr: Fenêtre principale avec thème sombre
it: Finestra principale con tema scuro
ru: Главное окно с темной темой

source: Change branding colors to a nice cherry
de: Ändern Sie die Branding-Farben in eine schöne Kirsche
es: Cambia los colores de la marca a un bonito cereza
fr: Changer les couleurs de la marque pour une belle cerise
it: Cambia i colori del branding in un bel ciliegia

source: All a glance: Preview tooltip shows all formats
de: Alles auf einen Blick: Vorschau-Tooltip zeigt alle Formate
es: Todo de un vistazo: La información sobre herramientas de previsualización muestra todos los formatos
fr: Tout en un coup d'œil : L'info-bulle de l'aperçu montre tous les formats
it: Tutto a colpo d'occhio: il tooltip di anteprima mostra tutti i formati

source: Fix regression: Allow --immediately-pick when the window is already open
de: Regression beheben: --immediately-pick zulassen, wenn das Fenster bereits geöffnet ist
es: Corregir regresión: Permitir --immediately-pick cuando la ventana ya está abierta
fr: Correction d'une régression : Autoriser --immediately-pick lorsque la fenêtre est déjà ouverte
it: Correzione regressione: Permetti --immediately-pick quando la finestra è già aperta
ru: Исправление регрессии: Разрешить --immediately-pick, когда окно уже открыто

source: Not sure how to fix yet: the crosshair doesnt show...
de: Bin mir noch nicht sicher, wie man das beheben kann: Das Fadenkreuz wird nicht angezeigt...
es: Aún no sé cómo solucionarlo: la retícula no aparece...
fr: Je ne sais pas encore comment résoudre le problème : le réticule ne s'affiche pas...
it: Non sono ancora sicuro di come risolverlo: il mirino non si vede...
ru: Пока не знаю, как исправить: перекрестие не отображается...

source: Clean appdata for flathub release
de: Bereinigung der Anwendungsdaten für die Flathub-Veröffentlichung
es: Limpiar appdata para la liberación de flathub
fr: Nettoyer les données d'application pour la version flathub
it: Pulisci i dati dell'app per la release su Flathub
ru: Очистите данные appdata для выпуска flathub

source: Make sure the app doesnt crash at startup for flathub builds
de: Stellen Sie sicher, dass die Anwendung beim Start von Flathub-Builds nicht abstürzt
es: Asegúrese de que la aplicación no se bloquee en el inicio de flathub construye
fr: S'assurer que l'application ne plante pas au démarrage pour les constructions flathub
it: Assicurati che l'app non si blocchi all'avvio per le build di Flathub
ru: Убедитесь, что приложение не падает при запуске для сборок flathub

source: App now works on ARM thanks to @ryonakano!
de: App funktioniert jetzt auf ARM dank @ryonakano!
es: ¡La aplicación ya funciona en ARM gracias a @ryonakano!
fr: L'application fonctionne maintenant sur ARM grâce à @ryonakano !
it: L'app ora funziona su ARM grazie a @ryonakano!
ru: Приложение теперь работает на ARM благодаря @ryonakano!

source: Add the ability to immediately pick and copy to clipboard
de: Hinzufügen der Möglichkeit zum sofortigen Auswählen und Kopieren in die Zwischenablage
es: Añade la posibilidad de seleccionar y copiar inmediatamente en el portapapeles
fr: Ajouter la possibilité de sélectionner et de copier immédiatement dans le presse-papiers
it: Aggiungi la possibilità di selezionare e copiare immediatamente negli appunti
ru: Добавьте возможность мгновенного выбора и копирования в буфер обмена

source: You can right-click on app icon and choose "Immediately pick"
de: Sie können mit der rechten Maustaste auf das App-Symbol klicken und "Sofort auswählen" wählen.
es: Puedes hacer clic con el botón derecho en el icono de la aplicación y elegir "Elegir inmediatamente".
fr: Vous pouvez cliquer avec le bouton droit de la souris sur l'icône de l'application et choisir "Récupérer immédiatement"
it: Puoi fare clic con il tasto destro sull'icona dell'app e scegliere "Seleziona immediatamente"
ru: Вы можете щелкнуть правой кнопкой мыши на значке приложения и выбрать "Немедленно выбрать".

source: Or set a keybind to "flatpak run io.ellie_commons.cherrypick --immediately-pick"
de: Oder setzen Sie eine Schlüsselbindung auf "flatpak run io.ellie_commons.cherrypick --immediately-pick"
fr: Ou mettre un keybind à "flatpak run io.ellie_commons.cherrypick --immediately-pick"
ru: Или установите привязку клавиш на "flatpak run io.ellie_commons.cherrypick --immediately-pick".

source: Updated deprecated widgets
de: Aktualisierte, veraltete Widgets
es: Widgets obsoletos actualizados
fr: Mise à jour des widgets obsolètes
it: Widget obsoleti aggiornati
ru: Обновление устаревших виджетов

source: Minute tweaks by @ryonakano thanks again!
de: Minutiöse Verbesserungen durch @ryonakano, danke nochmals!
es: Pequeños retoques de @ryonakano ¡Gracias de nuevo!
fr: Ajustements minimes par @ryonakano, merci encore !
it: Piccole modifiche di @ryonakano, grazie ancora!
ru: Минутные доработки от @ryonakano Спасибо еще раз!

source: Remove minor artifacts
de: Entfernen kleinerer Artefakte
es: Eliminar artefactos menores
fr: Supprimer les artefacts mineurs
it: Rimuovi artefatti minori
ru: Удалите незначительные артефакты

source: 2.0.0: The revival!
de: 2.0.0: Die Wiederbelebung!
es: 2.0.0: ¡El renacimiento!
fr: 2.0.0 : Le renouveau !
it: 2.0.0: Il ritorno!
ru: 2.0.0: Возрождение!

source: A new name, Cherrypick! Blessed by @adithyankv, the OG author. Thank you!
de: Ein neuer Name, Cherrypick! Gesegnet von @adithyankv, dem OG-Autor. Dankeschön!
es: Un nuevo nombre, ¡Cherrypick! Bendecido por @adithyankv, el autor OG. Gracias.
fr: Un nouveau nom, Cherrypick ! Béni par @adithyankv, l'auteur OG. Merci à vous !
it: Un nuovo nome, Cherrypick! Benedetto da @adithyankv, l'autore originale. Grazie!
ru: Новое имя, Черрипик! Благословлено @adithyankv, автором OG. Спасибо!

source: Port to modern tech (GTK4, Wayland, portals, elementary 8). Not broken anymore!
de: Portierung auf moderne Technik (GTK4, Wayland, Portale, Elementar 8). Nicht mehr gebrochen!
es: Adaptación a la tecnología moderna (GTK4, Wayland, portales, elementary 8). ¡Ya no está roto!
fr: Portage vers les technologies modernes (GTK4, Wayland, portails, elementary 8). Il n'est plus cassé !
it: Porting a tecnologia moderna (GTK4, Wayland, portali, elementary 8). Non più rotto!
ru: Переход на современные технологии (GTK4, Wayland, порталы, elementary 8). Больше не ломается!

source: CMYK model available thanks to @DSLitvinov
de: CMYK-Modell verfügbar dank @DSLitvinov
es: Modelo CMYK disponible gracias a @DSLitvinov
fr: Modèle CMYK disponible grâce à @DSLitvinov
it: Modello CMYK disponibile grazie a @DSLitvinov
ru: Модель CMYK доступна благодаря @DSLitvinov

source: HSL model available thanks to @ckruse's work on ColorMate
de: HSL-Modell verfügbar dank der Arbeit von @ckruse an ColorMate
es: Modelo HSL disponible gracias al trabajo de @ckruse en ColorMate
fr: Modèle HSL disponible grâce au travail de @ckruse sur ColorMate
it: Modello HSL disponibile grazie al lavoro di @ckruse su ColorMate
ru: Модель HSL доступна благодаря работе @ckruse над ColorMate

source: Also apparently HSLA is a thing so i added it
de: Anscheinend ist HSLA auch eine Sache, also habe ich es hinzugefügt
es: También al parecer HSLA es una cosa así que lo añadí
fr: Apparemment, HSLA existe aussi, alors je l'ai ajouté.
it: A quanto pare anche HSLA esiste, quindi l'ho aggiunto
ru: Также, очевидно, HSLA - это вещь, поэтому я добавил ее.

source: New feature: You can now paste a color from clipboard to preview it
de: Neue Funktion: Sie können jetzt eine Farbe aus der Zwischenablage einfügen, um sie in der Vorschau anzuzeigen
es: Nueva función: Ahora puedes pegar un color desde el portapapeles para previsualizarlo
fr: Nouvelle fonctionnalité : Vous pouvez maintenant coller une couleur depuis le presse-papiers pour la prévisualiser.
it: Nuova funzionalità: ora puoi incollare un colore dalla clipboard per visualizzarlo in anteprima
ru: Новая функция: Теперь вы можете вставить цвет из буфера обмена, чтобы предварительно просмотреть его

source: New feature: Hover over history buttons to see their code in your preferred format
de: Neue Funktion: Bewegen Sie den Mauszeiger über die Verlaufsschaltflächen, um deren Code in Ihrem bevorzugten Format anzuzeigen
es: Nueva función: Pasa el ratón por encima de los botones del historial para ver su código en el formato que prefieras.
fr: Nouvelle fonctionnalité : Survolez les boutons de l'historique pour voir leur code dans le format de votre choix.
it: Nuova funzionalità: passa con il mouse sopra i pulsanti della cronologia per vedere il loro codice nel tuo formato preferito
ru: Новая функция: Наведите курсор на кнопки истории, чтобы увидеть их код в удобном для вас формате

source: Add command line flag to open directly in color picking mode
de: Befehlszeilenflag hinzufügen, um direkt im Farbauswahlmodus zu öffnen
es: Añadir indicador de línea de comandos para abrir directamente en modo de selección de color
fr: Ajout d'un drapeau de ligne de commande pour ouvrir directement en mode de sélection des couleurs
it: Aggiungi flag della riga di comando per aprire direttamente in modalità di selezione colore
ru: Добавлен флаг командной строки для открытия сразу в режиме выбора цвета

source: Fix layout bug when opening multiple instances
de: Layout-Fehler beim Öffnen mehrerer Instanzen behoben
es: Corrección de un error de diseño al abrir varias instancias
fr: Correction d'un bug de mise en page lors de l'ouverture de plusieurs instances
it: Correzione bug di layout all'apertura di più istanze
ru: Исправлен баг интерфейса при открытии нескольких окон

source: Make pick color button the default focused widget
de: Farbauswahl-Schaltfläche zum standardmäßig fokussierten Widget machen
es: Hacer que el botón de selección de color sea el widget enfocado por defecto
fr: Faire du bouton de sélection des couleurs le widget focalisé par défaut
it: Rendi il pulsante di selezione colore il widget predefinito con focus
ru: Кнопка выбора цвета теперь сфокусирована по умолчанию

source: Remove payment option from appcenter
de: Zahlungsoption aus dem Appcenter entfernen
es: Eliminar la opción de pago de appcenter
fr: Supprimer l'option de paiement de l'appcenter
it: Rimuovi l'opzione di pagamento da AppCenter
ru: Убрана опция покупки из AppCenter

source: Update to elementary platform 7
de: Aktualisierung auf die elementare Plattform 7
es: Actualización a la plataforma elemental 7
fr: Mise à jour vers la plateforme élémentaire 7
it: Aggiorna a elementary platform 7
ru: Обновлено до elementary platform 7

source: Minor change to app description
de: Geringfügige Änderung der App-Beschreibung
es: Cambio menor en la descripción de la aplicación
fr: Modification mineure de la description de l'application
it: Modifica minore alla descrizione dell'app
ru: Небольшое изменение описания приложения

source: Fix inaccuracies in metadata
de: Behebung von Ungenauigkeiten in Metadaten
es: Corrección de imprecisiones en los metadatos
fr: Corriger les inexactitudes dans les métadonnées
it: Correzione di imprecisioni nei metadata
ru: Исправлены неаккуратности в метаданных

source: Add stripe key
de: Strip-Schlüssel hinzufügen
es: Añadir clave de banda
fr: Ajouter une clé de stripe
it: Aggiungi chiave Stripe
ru: Добавлен ключ Stripe

source: Initial release
de: Erste Veröffentlichung
es: Lanzamiento inicial
fr: Version initiale
it: Rilascio iniziale
ru: Начальный релиз

source: Or set a keybind to "flatpak run io.elly_code.cherrypick --immediately-pick"
es: O establece un keybind a "flatpak run io.elly_code.cherrypick --immediately-pick"
it: Oppure imposta un tasto di scelta rapida a "flatpak run io.elly_code.cherrypick --immediately-pick"
