Repository: elly-code/cherrypick
Catalog: po/*.po
Languages: de, es, fr, it, sv

source: Click to paste a colour if you have one saved up
de: Klicken Sie hier, um eine Farbe einzuf체gen, wenn Sie eine gespeichert haben
es: Haz clic para pegar un color si tienes uno guardado
fr: Cliquez pour coller une couleur si vous en avez une de sauvegardée
it: Fai clic per incollare un colore se ne hai uno salvato
sv: Klicka för att klistra in en färg om du har en sparad

source: Click to copy this colour to your clipboard
de: Klicken Sie, um diese Farbe in Ihre Zwischenablage zu kopieren
es: Haga clic para copiar este color en el portapapeles
fr: Cliquez pour copier cette couleur dans votre presse-papiers
it: Fai clic per copiare questo colore negli appunti
sv: Klicka för att kopiera denna färg till urklipp

source: Choose your preferred format to display picked colours
de: W채hlen Sie Ihr bevorzugtes Format f체r die Anzeige von Farben
es: Elige el formato que prefieras para mostrar los colores elegidos
fr: Choisissez votre format préféré pour afficher les couleurs sélectionnées
it: Scegli il formato preferito per visualizzare i colori selezionati
sv: Välj önskat format för att visa valda färger

source: Copied to clipboard!
de: In die Zwischenablage kopiert!
es: Copiado al portapapeles.
fr: Copié dans le presse-papiers !
it: Copiato negli appunti!
sv: Kopierad till urklipp!

source: Cannot detect colour!
de: Kann keine Farbe erkennen!
es: No detecta el color.
fr: Impossible de détecter la couleur !
it: Impossibile rilevare il colore!
sv: Kan inte upptäcka färg!

source: History
de: Verlauf
es: Historia
fr: Historique
it: Cronologia
sv: Historik

source: Save a snapshot of current color history
de: Speichern eines Schnappschusses des aktuellen Farbverlaufs
es: Guardar una instantánea del historial de colores actual
fr: Sauvegarde d'un instantané de l'historique des couleurs
it: Salva uno snapshot della cronologia del colore corrente
sv: Spara en ögonblicksbild av aktuell färghistorik

source: Restore history snapshot
de: Schnappschuss der Historie wiederherstellen
es: Restaurar instantánea del historial
fr: Restaurer l'instantané de l'historique
it: Ripristina snapshot della cronologia
sv: Återställ historikens ögonblicksbild

source: History saved
de: Verlauf gespeichert
es: Historia guardada
fr: Historique sauvé
it: Cronologia salvata
sv: Historik sparad

source: Pick a colour and copy it to clipboard
de: Eine Farbe ausw채hlen und in die Zwischenablage kopieren
es: Elige un color y cópialo en el portapapeles
fr: Choisissez une couleur et copiez-la dans le presse-papiers.
it: Scegli un colore e copialo negli appunti
sv: Välj en färg och kopiera den till urklipp
